// ---------------------------------------------------------------LIST-01------------------------------------------------------------------

// ---------------------------------------------------------------task-01------------------------------------------------------------------

// Функция для поиска квадратного корня числа
// function найтиКвадратныйКорень(число) {
//     // Math.sqrt() - функция, вычисляющая квадратный корень
//     var квадратныйКорень = Math.sqrt(число);
//     return квадратныйКорень;
// }

// // Пример использования функции
// var число = prompt("Введите число:");
// число = parseFloat(число);

// // Вызываем функцию для нахождения квадратного корня
// var квадратныйКорень = найтиКвадратныйКорень(число);

// // Выводим результат в консоль
// console.log("Квадратный корень числа: " + квадратныйКорень);




// --------------------------------------------------------------- task-02------------------------------------------------------------------

// let celsius = prompt("Dərəcəni yazin zəhmət olmasa")
// let farenheit = celsius * 1.8 + 32;
// console.log("daxil etdiyiniz " + celsius + " selsi " + farenheit + "-e beraberdir.")
// _______________________________________________________________________________________________________________________________________





// --------------------------------------------------------------- task-03------------------------------------------------------------------

// let number = prompt('Isdədiyiniz rəqemi yazin');
// if (number > 0) {
//     console.log("Daxil etdiyiniz nömrə müsbətdir!")
// }

// else if (0 > number) {
//     console.log("Daxil etdiyiniz nömrə mənfidir!")
// }

// else if (number == 0) {
//     console.log("Daxil etdiyiniz nömrə sıfırdır")
// }
// else {
//     console.log('Yalnish!!!!')
// }
// _______________________________________________________________________________________________________________________________________



// --------------------------------------------------------------- task-04------------------------------------------------------------------

// let number = prompt('Tək və ya Cüt rəqəm yazın')
// if (number < 10) {
//     console.log(number + ' Tək ədətdir')
// }
// else if (100 > number) {
//     console.log(number + ' Cüt ədətdir')
// }
// else {
//     console.log('Yalnish !!!!')
// }
// _______________________________________________________________________________________________________________________________________




// --------------------------------------------------------------- task-05------------------------------------------------------------------

// let num1 = prompt('Birinci ədədi daxil edin');
// let num2 = prompt('İkinci ədədi daxil edin');
// let num3 = prompt('Üçüncü ədədi daxil edin');
// let max = Math.max(num1, num2, num3);
// console.log('Ən böyük ədəd:', max)
// _______________________________________________________________________________________________________________________________________



// --------------------------------------------------------------- task-05------------------------------------------------------------------

// let num1 = prompt('Birinci ədədi daxil edin');
// let num2 = prompt('İkinci ədədi daxil edin');
// let num3 = prompt('Üçüncü ədədi daxil edin');
// if (num1 > num3 && num1 > num2) {
//     console.log(num1);
// }
// else if (num2 > num1 && num2 > num3) {
//     console.log(num2)
// }
// else if (num3 > num1 && num3 > num2) {
//     console.log(num3)
// }
// _______________________________________________________________________________________________________________________________________


// --------------------------------------------------------------- task-06------------------------------------------------------------------



// let num1 = parseFloat(prompt("Birinci rəqəmi daxil edin"))
// let operator = (prompt("Operatora  (+, -, * və ya /) daxil edin"))
// let num2 = parseFloat(prompt("İkinci rəqəmi daxil edin"))

// if (isNaN(num1) || isNaN(num2)) {
//     console.log("Rəqəm yazın!!!!")
// } else {
//     switch (operator) {
//         case "+":
//             result = num1 + num2;
//             console.log("Cavab: " + result + "-edir")
//             break;
//         case "-":
//             result = num1 - num2;
//             console.log("Cavab: " + result + "-edir")
//             break;
//         case "*":
//             result = num1 * num2;
//             console.log("Cavab: " + result + "-edir")
//             break;
//         case "/":
//             if (num2 !== 0) {
//                 result = num1 / num2;
//                 console.log("Cavab4 " + result + " edir")
//             }
//             else {
//                 console.log("Qalıxsız rəqəm yazın")
//             }
//             break;

//         default:
//             console.log("Yanlış operator daxil etdiniz")
//             break;
//     }
// }


// _______________________________________________________________________________________________________________________________________

// --------------------------------------------------------------- LIST-02------------------------------------------------------------------


// --------------------------------------------------------------- task-01------------------------------------------------------------------

// let simpleWord = prompt('user, admin, guest bu sozlerden basqa hecne yazmayin!');
// switch (simpleWord) {
//     case "user":
//         console.log('xos geldin istifadeci');
//         break
//     case "admin":
//         console.log('xos geldin cenab admin');
//         break
//     case "guest":
//         console.log('xos geldin qonaq')
//         break
//     default:
//         console.log('Daxil etdiyiniz deyer yalsnisdi!')
// }
// _______________________________________________________________________________________________________________________________________






// --------------------------------------------------------------- task-01------------------------------------------------------------------

// let simpleWord = prompt('user, admin, guest bu sozlerden basqa hecne yazmayin!');
// if (simpleWord === 'user') {
//     console.log('xos geldin istifadeci');
// }
// else if (simpleWord === 'admin') {
//     console.log('xos geldin cenab admin');
// }
// else if (simpleWord === 'guest') {
//     console.log('xos geldin qonaq');
// }
// else {
//     console.log('Daxil etdiyiniz deyer yalsnisdi!')
// }
// _______________________________________________________________________________________________________________________________________





// --------------------------------------------------------------- task-02------------------------------------------------------------------

// let FizzBuzz = prompt('3-e ve 5-e bolunen reqem yazin')
// if (FizzBuzz % 3 === 0 && FizzBuzz % 5 === 0) {
//     console.log("(FizzBuzz) " + "yazilan reqem:" + FizzBuzz + "!" + " 3-e ve 5-e bolunur")
// }
// else if (FizzBuzz % 3 === 0) {
//     console.log("(Fizz) " + "yazilan reqem:" + FizzBuzz + "!" + " 3-e bolunur");
// }
// else if (FizzBuzz % 5 === 0) {
//     console.log("(Buzz)" + "yazilan reqem:" + FizzBuzz + "!" + " 3-e bolunur");
// }
// else {
//     console.log("Yalnish deyer! Zehmet olmasa duz yazin!")
// }
// _______________________________________________________________________________________________________________________________________






// --------------------------------------------------------------- task-03------------------------------------------------------------------

// let twoNumber = prompt("2 eded daxil edin");
// if (twoNumber.length >= 2) {
//     console.log('eded ikireqemlidir')
// }

// else {
//     console.log('Yalmish deyer!')
// }
// _______________________________________________________________________________________________________________________________________





// --------------------------------------------------------------- task-03------------------------------------------------------------------
// let twoNumber = prompt("2 eded daxil edin");
// switch (twoNumber) {
//     case twoNumber.length >= 2:
//         console.log('xos geldin istifadeci');
//         break
//     default:
//         console.log('Daxil etdiyiniz deyer yalsnisdi!')
// }
// _______________________________________________________________________________________________________________________________________




// ----------------------------------------------------------------task-04-----------------------------------------------------------------
// let FizzBuzz = prompt('2-e ve 5-e bolunen reqem yazin')
// if (FizzBuzz % 2 === 0 && FizzBuzz % 5 === 0) {
//     console.log("Bu istediyim ededdir")
// }
// else {
//     console.log('Daxil etdiyiniz deyer yalsnisdi!')
// }
// _______________________________________________________________________________________________________________________________________




// ----------------------------------------------------------------- task-05---------------------------------------------------------------
// let i = prompt("100-den cox reqem yazmayin")
// if (i > 100) {
//     console.log("cemleri kecdi 100u")
// }
// else if (i > 1) {
//     console.log(i)
// }
// ______________________________________________________________________________________________________________________________________



// ------------------------------------------------Язык_программирование_JavaScript_из_кники----------------------------------------------
//     "" + 1 + 0 = 10
// "" - 1 + 0 = -1
// true + false = 1
// 6 / "3" = 2
// "2" * "3" = 6
// 4 + 5 + "px" = 9px
// "$" + 4 + 5 = $45
// "4" - 2 = 2
// "4px" - 2 = NaN
// 7 / 0 = Infinity
// " -9 " + 5 = -9 5
// " -9 " - 5 = -14
// null + 1 = 1
// undefined + 1 = Nan
// " \t \n" - 2 = - 2
// _______________________________________________________________________________________________________________________________________

// ------------------------------------------------Язык_программирование_JavaScript_из_кники----------------------------------------------
// --------------------------------------------------------- _JavaScript cтр.96-----------------------------------------------------------

// 5 > 4  // true
// "ананас" > "яблоко" // false
// "2" > "12" // true
// undefined == null // true
// undefined === null // false
// null == "\n0\n"  //false
// null === "\n0\n"  //false
// _______________________________________________________________________________________________________________________________________





// ------------------------------------------------Язык_программирование_JavaScript_из_кники----------------------------------------------
// --------------------------------------------------------- Название_JavaScript cтр.105--------------------------------------------------

// let JavaScript = prompt("Какое официальное название JavaScript?", '')
// if (JavaScript == 'ECMAScript') {
//     alert("Верно!")
// } else {
//     alert("Не знаете? ECMAScript!")
// }
// _______________________________________________________________________________________________________________________________________

// ------------------------------------------------Язык_программирование_JavaScript_из_кники----------------------------------------------
// --------------------------------------------------------------JavaScript cтр.106-------------------------------------------------------

// let number = prompt("Напишите цифру больше или меньше нуля")
// if(number > 0){
//     alert("значение больше нуля:")
// }
// else if(0 > number){
//     alert("значение меньше нуля:")
// }
// else if(number == 0){
//     alert("значение ровно нулю:")
// }
// else{ 
//     alert("ОШИБКА!!!")
// }
// _______________________________________________________________________________________________________________________________________



// ------------------------------------------------Язык_программирование_JavaScript_из_кники---------------------------------------------
// --------------------------------------------------------------JavaScript cтр.118------------------------------------------------------
// ---------------------------------------------------------Проверка значения из диапазона-----------------------------------------------

// let age = prompt('Напишите возраст в диапазоне число между 90 и 14')
// if (age >= 14 && age <= 90) {
//     console.log("Возраст находится в диапазоне от 14 до 90 включительно.");
// } else {
//     console.log("Возраст не находится в диапазоне от 14 до 90 включительно.");
// }
// _______________________________________________________________________________________________________________________________________


// --------------------------------------------------------------JavaScript cтр.118-------------------------------------------------------
// ---------------------------------------------------------Проверка значения вне диапазона-----------------------------------------------
// let age = prompt('Напишите возраст в диапазоне число между 90 и 14')
// if (!(age >= 14 && age <= 90)) {
//     console.log("Возраст не находится в диапазоне от 14 до 90 включительно.");
// } else {
//     console.log("Возраст находится в диапазоне от 14 до 90 включительно.");
// }
// _______________________________________________________________________________________________________________________________________


// --------------------------------------------------------------JavaScript cтр.119-------------------------------------------------------
// ---------------------------------------------------------------Проверка логина---------------------------------------------------------

// let login = prompt('Введите логин')
// if (login === 'Админ') {
//     let password = prompt("Введите пароль")
//     if (password === ""){
//     alert('Отменено')
//     }
//     else {
//         alert('Я вас не знаю')
//     }
// }
// else{
//     alert('Ошибка!')
// }

// _______________________________________________________________________________________________________________________________________

// --------------------------------------------------------- Видое_рекорд_JavaScript 47:45---------------------------------------------------
// alert(5 > 4) // true
// alert("apple" > "pineapple") //false
// alert("2" > "12") // true
// alert(undefined == null) // true
// alert(undefined === null) //false
// alert(null == " 0") //false
// alert(null === +"0") // false
// _______________________________________________________________________________________________________________________________________


// --------------------------------------------------------- Видое_рекорд_JavaScript 14:44---------------------------------------------------

// let num = prompt("2 ve 3-e bolunen yazin")
// if(num % 2 === 0 && num % 3 === 0){
//     console.log("eded 6-ya bolunur")
// }
// else {
//     console.log('eded 6-ya bolunmur')
// }
// _______________________________________________________________________________________________________________________________________


// --------------------------------------------------------- Видое_рекорд_JavaScript 11:06---------------------------------------------------

// let FizzBuzz = prompt('3-e ve 5- bolunen yazin')
// if (FizzBuzz % 3 === 0 && FizzBuzz % 5 === 0){
//     console.log('FizzBuzz')
// }
// else if(FizzBuzz % 3 === 0){
//     console.log('Fizz')
// }
// else if(FizzBuzz % 5 === 0){
//     console.log('Buzz')
// }
// else {
//     console.log('Hec bir sertde olan ededlere bolunmur!!')
// }
// _______________________________________________________________________________________________________________________________________

// --------------------------------------------------------- Видое_рекорд_JavaScript 14:10---------------------------------------------------


// let ed = prompt("eded yaz")
// let msg = ''
// if (ed % 3 === 0){
//     msg =  'Fizz'
// }
// if( ed % 5 === 0){
//     msg = msg + "Buzz"
// }
// console.log(msg)
// _______________________________________________________________________________________________________________________________________




