
// let o = 25
// let o2 = o
// o = 'on alti'
// console.log(o) // on alti
// console.log(o2) // on



// -----------------------------------------------------------------------------------------------------------------------------------------------------------------------
// let o = {
//     ad: 'ali'
// }
// let o2 = o
// o.ad = 'ruslan'
// console.log(o.ad)
// console.log(o2.ad)
// _______________________________________________________________________________________________________________________________________________________________________



// function myFunction(a, b) {
//     return a.indexOf(b) !== -1 ? b + a : a + b;
// }

// console.log(myFunction('cheese', 'cake')); // Ожидаемый результат: 'cheesecake'
// console.log(myFunction('lips', 's')); // Ожидаемый результат: 'slips'
// console.log(myFunction('Java', 'script')); // Ожидаемый результат: 'Javascript'
// console.log(myFunction(' think, therefore I am', 'I')); // Ожидаемый результат: 'I think, therefore I am'

// _______________________________________________________________________________________________________________________________________________________________________

// function myFunction(a, b) {
//     return b.split(a).length - 1;
//   }

//   console.log(myFunction('m', 'how many times does the character occur in this sentence?')); // Ожидаемый результат: 2
//   console.log(myFunction('h', 'how many times does the character occur in this sentence?')); // Ожидаемый результат: 4
//   console.log(myFunction('?', 'how many times does the character occur in this sentence?')); // Ожидаемый результат: 1
//   console.log(myFunction('z', 'how many times does the character occur in this sentence?')); // Ожидаемый результат: 0
// _______________________________________________________________________________________________________________________________________________________________________

// function myFunction(a) {
//     return Math.round(a * 100) / 100;
//   }

//   console.log(myFunction(2.12397)); // Ожидаемый результат: 2.12
//   console.log(myFunction(3.136));   // Ожидаемый результат: 3.14
//   console.log(myFunction(1.12397)); // Ожидаемый результат: 1.12
//   console.log(myFunction(26.1379)); // Ожидаемый результат: 26.14
// _______________________________________________________________________________________________________________________________________________________________________


// function myFunction(a) {
//     return Array.from(String(a), Number);
//   }

//   console.log(myFunction(10));      // Ожидаемый результат: [1, 0]
//   console.log(myFunction(931));     // Ожидаемый результат: [9, 3, 1]
//   console.log(myFunction(193278));  // Ожидаемый результат: [1, 9, 3, 2, 7, 8]
// _______________________________________________________________________________________________________________________________________________________________________


// function prop2Taker(obj) {
//         return obj['prop-2'];
// }

// console.log(prop2Taker({ ad: 1, 'prop-2': 2 }));
// console.log(prop2Taker({ 'prop-2': 'two', prop: 'test' }));

// _______________________________________________________________________________________________________________________________________________________________________


// function myFunction(a) {
//     return { key: a };
//   }
//   console.log(myFunction('a')); // Ожидалось: {key:'a'}
//   console.log(myFunction('z')); // Ожидалось: {key:'z'}
//   console.log(myFunction('b')); // Ожидалось: {key:'b'}
// _______________________________________________________________________________________________________________________________________________________________________

// const o = {
//     ad: "Ali"
// }
// const o2 = o;
// const o3 = {
//     ad: "Ali"
// }
// console.log(o == o2)
// console.log(o == o3)
// console.log(o2 == o3)
// _______________________________________________________________________________________________________________________________________________________________________


// let a = 'a'; //primitive
// let b = a;
// a = 'c';
// console.log(b)   //a
// console.log(a)   //c
// _______________________________________________________________________________________________________________________________________________________________________

// let f = 1;
// let g = f;

// g = 5;
// console.log(f)    //1
// console.log(g)    //5
// _______________________________________________________________________________________________________________________________________________________________________

// let ob = {}
// let ob2 = ob
// ob2.ad = 'a'
// console.log(ob.ad)  // a
// console.log(ob2.ad) // a 
// _______________________________________________________________________________________________________________________________________________________________________


// let a = 1
// let b = 1
// console.log(a == b) //true
// _______________________________________________________________________________________________________________________________________________________________________


// let a = {}
// let b = {}
// console.log(a == b) // false
// _______________________________________________________________________________________________________________________________________________________________________



// let o = {}
// let o2 = o
// console.log(o == o2)  //true
// _______________________________________________________________________________________________________________________________________________________________________
// const o = {
//     ad: 'Ali'
// }
// const o2 = o

// const o3 = {
//     ad:'Ali'
// }

// console.log(o == o2)   //true
// console.log(o == o3)   //false
// console.log(o2 == o3)  //false
// _______________________________________________________________________________________________________________________________________________________________________

// function changeA(a) {
//     a.age = 12
//     a.ad = 'ruslan'
// }

// let g = { age: 13 }
// changeA(g)


// console.log(g.ad)  //ruslan


// console.log(g.age) //12
// _______________________________________________________________________________________________________________________________________________________________________

// const human = {
//     ad: 'Ali',
//     age: 22
// }

// const hum = human 
// human.ad = 'Ruslan'

// console.log(hum.ad)    // Ruslan 
// console.log(human.ad)  // Ruslan   
// _______________________________________________________________________________________________________________________________________________________________________



// const human = {
//     ad: 'Ali',
//     age: 22,
// }

// const hum = {...human}
// human.ad = 'Ruslan'

// console.log(hum.ad)    // Ali 
// console.log(human.ad)  // Ruslan 
// _______________________________________________________________________________________________________________________________________________________________________

